# DataCleaning using Pandas

In [102]:
import pandas as pd
import numpy as np

In [151]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [152]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [153]:
df.iloc[1,1] = 10055
df.iloc[3,1] = 10075

In [154]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [155]:
df.iloc[:,1].dtypes

dtype('float64')

In [156]:
df.iloc[:,1] = pd.DataFrame(df['FlightNumber'], dtype = 'int64')

In [157]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [158]:
df.iloc[:,1].dtypes

dtype('int64')

In [159]:
df_temporary = pd.DataFrame({'From': ['LoNDon', 'MAdrid',
'londON',
'Budapest', 'Brussels'], 'To': ['paris','miLAN','StockhOlm','PaRis','londOn']})

In [160]:
df_temporary

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [161]:
df_temporary.iloc[0,0]= str.title(df_temporary.iloc[0,0])
df_temporary.iloc[1,0]= str.title(df_temporary.iloc[1,0])
df_temporary.iloc[2,0]= str.title(df_temporary.iloc[2,0])
df_temporary.iloc[3,0]= str.title(df_temporary.iloc[3,0])
df_temporary.iloc[4,0]= str.title(df_temporary.iloc[4,0])
df_temporary.iloc[0,1]= str.title(df_temporary.iloc[0,1])
df_temporary.iloc[1,1]= str.title(df_temporary.iloc[1,1])
df_temporary.iloc[2,1]= str.title(df_temporary.iloc[2,1])
df_temporary.iloc[3,1]= str.title(df_temporary.iloc[3,1])
df_temporary.iloc[4,1]= str.title(df_temporary.iloc[4,1])

In [162]:
df_temporary

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [163]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [164]:
df.drop('From_To', axis=1, inplace=True)
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [165]:
df['From']  = df_temporary['From']
df['To']  = df_temporary['To']

In [166]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [167]:
delays = pd.DataFrame(df, columns = ['delay_1','delay_2','delay_3'])
delays

   delay_1  delay_2  delay_3
0      NaN      NaN      NaN
1      NaN      NaN      NaN
2      NaN      NaN      NaN
3      NaN      NaN      NaN
4      NaN      NaN      NaN

In [168]:
delays.iloc[0,1] = df['RecentDelays'][0][0]
delays.iloc[0,2] = df['RecentDelays'][0][1]
delays.iloc[2,0] = df['RecentDelays'][2][0]
delays.iloc[2,1] = df['RecentDelays'][2][1]
delays.iloc[2,2] = df['RecentDelays'][2][2]
delays.iloc[3,2] = df['RecentDelays'][3][0]
delays.iloc[4,1] = df['RecentDelays'][4][0]
delays.iloc[4,2] = df['RecentDelays'][4][1]

In [169]:
delays

   delay_1  delay_2  delay_3
0      NaN     23.0     47.0
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3      NaN      NaN     13.0
4      NaN     67.0     32.0

In [172]:
df['delay_1'] = delays['delay_1']
df['delay_2'] = delays['delay_2']
df['delay_3'] = delays['delay_3']
Col_name1 = df.columns[0]
Col_name3 = df.columns[2]
Col_name2 = df.columns[3:8:1]
df1 = pd.DataFrame(df, columns =  Col_name2)
df1[Col_name1] = df[Col_name1]
df1[Col_name3] = df[Col_name3]

df = df1[[df1.columns[0],df1.columns[1],df1.columns[5],df1.columns[2],df1.columns[3],df1.columns[4],df1.columns[6]]]
df

,From,To,FlightNumber,delay_1,delay_2,delay_3,Airline
0,London,Paris,10045,NaN,23.0,47.0,KLM(!)
1,Madrid,Milan,10055,NaN,NaN,NaN,<Air France> (12)
2,London,Stockholm,10065,24.0,43.0,87.0,(British Airways. )
3,Budapest,Paris,10075,NaN,NaN,13.0,12. Air France
4,Brussels,London,10085,NaN,67.0,32.0,"""Swiss Air"""

In [173]:
type(df)

pandas.core.frame.DataFrame